products = {
    1: {
        "name": "Белковый коктейль",
        "description": "Любишь полакомиться свежей клубникой? Наслаждайся любимым вкусом и пользой круглый год с протеиновым коктейлем «Клубника»! "
                       "Он поможет поддерживать организм и сохранять вес в норме.",
        "price": 3186
    },
    2: {
        "name": "Имбирный чай",
        "description": "Укрепить иммунитет, получить заряд энергии, очистить организм от лишнего, "
                       "нормализовать аппетит – все это под силу имбирю!",
        "price": 116
    },
    3: {
        "name": "Слимчай",
        "description": "Слим-чай фруктовый из коллекции EcoDeViva помогает соблюдать диету без вреда для здоровья:"
                       " не выводит витамины и минералы, а, наоборот, насыщает ими организм.",
        "price": 831
    },
    4: {
        "name": "Фитоформула",
        "description": "Крепкий иммунитет, энергия и поддержка половой сферы – в каждом стике «Фитоформулы с красной щеткой»!",
        "price": 998
    }
}
